{
  "overallRating": 4.8,
  "totalReviews": 883,
  "reviews": [
    {
      "author_name": "G- Smoke",
      "author_url": "https://www.google.com/maps/contrib/102580103812279889848/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "/review-avatars/avatar_0_ff1cdab0.jpg",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Simply, the best!\nI took my BMW M3 , and here’s the surprise !! Boom!!!!!! They are beyond the limits with the quality and experience!!! Big thanks to Michael!! They deserve 7 stars",
      "time": 1746633712,
      "translated": false
    },
    {
      "author_name": "Shokhrukh Fozilbekov",
      "author_url": "https://www.google.com/maps/contrib/110576292290404614687/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "/review-avatars/avatar_1_b01d2c12.jpg",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I took my car to MBR AUTO Garage as my car was broken down. I was thoroughly impressed with their honesty. They conducted a full inspection and explained all the necessary repairs in detail without any pressure to upsell services I didn't need. Their transparency gave me confidence in their work. I will definitely return! It's rare to find such dedication to customer service. Highly recommended!!!",
      "time": 1746434656,
      "translated": false
    },
    {
      "author_name": "Sinaver",
      "author_url": "https://www.google.com/maps/contrib/101509035281395650685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "/review-avatars/avatar_2_b8029e35.jpg",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Great experience, came here to change tyres delivered by PitStopArabia, got a discount on wheel alignment.\n\nDuring alignment they noticed a minor oil leak under the car, which they examined as well, and suggested to change gasket / rubber seal on next service.\n\nThanks, Mike!",
      "time": 1743002977,
      "translated": false
    },
    {
      "author_name": "Judy O",
      "author_url": "https://www.google.com/maps/contrib/112070191340906427050/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "/review-avatars/avatar_3_711e71dd.jpg",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I have been an MBR Auto Service client for the past two years and I couldn't be more impressed with the quality of service I have received. From start to finish, the experience has been seamless, efficient, and stress-free.\n\nThe staff is incredibly friendly and professional. They always take the time to listen to my concerns and explain me every step of the process in detail. They ensure that I am comfortable with the service and update me regularly while the work is being done.\n\nI am pleasantly surprised by how quickly they complete the services. Despite being busy, they always manage to have my car ready earlier than expected, which is a huge plus for my busy schedule.\n\nTheir attention to detail, commitment to customer satisfaction, and exceptional expertise make them stand out. I would highly recommend them to anyone looking for reliable and high-quality car service.",
      "time": 1736848090,
      "translated": false
    },
    {
      "author_name": "Elyes Boukadi",
      "author_url": "https://www.google.com/maps/contrib/102573306514758166053/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "/review-avatars/avatar_4_cfa2f2a5.jpg",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "⭐⭐⭐⭐⭐ MBR Auto Services – The Ultimate Performance Shop!\n\nI recently had a horrible experience with another garage that completely botched the repair of my C63s. They left me with a broken differential, poor suspension and steering rack installation, and an off-center alignment that made the car unsafe to drive. I was absolutely devastated—my C63s is my pride and joy, and it felt like it had been ruined.\n\nThat all changed when I took my car to MBR Auto Services.\n\nFrom the moment I walked in, I was met with professionalism, expertise, and genuine passion for performance vehicles. Michael, the manager, stood out immediately—his technical knowledge about tuning, performance upgrades, and sports cars is simply next-level. He took the time to thoroughly assess the damage and worked with his team to completely revive my car beyond my expectations.\n\nThe Work Done on My C63s:\n\n✔️ Suspension Upgrade & Calibration: The new suspension setup is absolutely flawless. The ride is precisely tuned, and even with traction off, the car sticks to the road beautifully with the Michelin Pilot Sport 4S tires they installed. The handling is now razor-sharp, making the car feel like it’s on rails.\n\n✔️ Steering & Alignment Fix: The previous garage left my car with an awful alignment issue, but MBR Auto Services completely corrected it. Steering response is crisp and accurate, restoring full confidence behind the wheel.\n\n✔️ Differential Replacement with Premium Additives: They replaced the broken differential with a perfectly matched unit, using only the best additives that I specifically requested. The power delivery is now buttery smooth and rock solid.\n\n✔️ Performance Enhancements: Thanks to their expert tuning, my boost increased to 32psi, and shifts are now faster and sharper. The car pulls stronger than ever, and I can feel a massive difference in both acceleration and stability.\n\nWhy MBR Auto Services Stands Out:\n\n✅ Michael's Expertise: His deep knowledge of AMG tuning, suspension calibration, and differential upgrades is unparalleled. He genuinely understands what high-performance cars need and delivers perfection in execution.\n\n✅ Attention to Detail: Every single aspect of my car was meticulously fine-tuned. They don’t just “fix” cars—they elevate them.\n\n✅ Honest & Transparent Service: Unlike my previous experience, MBR Auto Services communicates clearly, explains everything in detail, and ensures you know exactly what’s being done to your car.\n\n✅ Passion for Performance: You can tell that the entire team lives and breathes high-performance vehicles. This isn’t just a job for them—it’s their craft, and they take immense pride in it.\n\nI walked into MBR Auto Services feeling broken and defeated, but thanks to Michael and his incredible team, my C63s has been reborn into an absolute beast. If you own a high-performance car and want flawless service, expert tuning, and genuine care for your vehicle, this is the place to go.\n\nHighly recommended. I will only trust MBR Auto Services with my car from now on.\n\n⭐ 10/10 – The Best Performance Garage You’ll Ever Find!",
      "time": 1740639056,
      "translated": false
    }
  ]
}